Python_gunicorn_test.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8100

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      10
Time taken for tests:   0.297 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      170000 bytes
HTML transferred:       13000 bytes
Requests per second:    3369.89 [#/sec] (mean)
Time per request:       2.967 [ms] (mean)
Time per request:       0.297 [ms] (mean, across all concurrent requests)
Transfer rate:          559.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    3   0.8      3      10
Waiting:        1    3   0.8      3      10
Total:          1    3   0.8      3      10

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      4
  95%      4
  98%      5
  99%      5
 100%     10 (longest request)